app/Http/Controllers/AtendenteController.php

select * from "atendentes" where exists (select * from "pessoas" where "atendentes"."id_pessoa" = "pessoas"."id" and "nome_completo"::text ilike '%gi%')
---
    public function index(Request $request)
    {

        $ddd = DB::select('select id, descricao from tp_ddd');

        $grupos = DB::select('select id, nome from grupo order by nome');

        $sexo = DB::select('select id, tipo from tp_sexo');

        $atendente = DB::table('atendentes AS ad')
                    ->select('p.id AS idp', 'p.nome_completo', 'p.cpf', 'tps.tipo', 'dt_nascimento', 'sexo', 'p.email', 'p.ddd', 'p.celular', 'tsp.id AS idtps', 'p.status', 'tsp.tipo AS tpsta', 'd.id as did', 'd.descricao as ddesc', 'p.motivo_status', 'ad.id_grupo', 'g.nome AS gnome')
                    ->leftJoin('pessoas AS p', 'ad.id_pessoa', 'p.id')
                    ->leftjoin('tipo_status_pessoa AS tsp', 'p.status', 'tsp.id')
                    ->leftJoin('tp_sexo AS tps', 'p.sexo', 'tps.id')
                    ->leftJoin('tp_ddd AS d', 'p.ddd', 'd.id')
                    ->leftJoin('grupo AS g', 'ad.id_grupo', 'g.id');

        $nome = $request->nome;

        if ($request->nome) {
                $atendente->where('p.nome_completo', 'ilike', "%$request->nome%");