app/Http/Controllers/TesteController.php

select * from "pessoas" where "nome_completo"::text like '%ma%'
select * from "atendentes"
select * from "pessoas"
select * from "pessoas" where "pessoas"."id" = 6 limit 1
---
    public function index()
    {


        $search = 'ma';
        $pessoasAtendentes = Atendente::whereBelongsTo(Pessoa::where('nome_completo', 'like','%'.$search.'%')->get())->get()->toArray();
        dump($pessoasAtendentes);

        $pessoasAtendentes = Atendente::whereHas('pessoa', function ($query) use ($search) {
            $query->where('nome_completo', 'ilike', '%'.$search.'%');
        })->get()->toArray();
        dump($pessoasAtendentes);

        $atendenteDisponivel = Atendente::whereBelongsTo(Pessoa::find(6)->nome_completo, 'Maria da Penha')->get();