app/Http/Controllers/TesteController.php

select * from "pessoas" where "pessoas"."id" = 6 limit 1
---
    public function referenceCodes(){

        $Atendente = Pessoa::find(1)->atendente;